console.log(
   `
   Привет, Shelter part2 выполнила полностью, все требования постаралась выполнить. Рассчитываю на максимальный балл.\n
   Самооценка и пояснения по выполнению ниже.\n
   Если будут вопросы по работе, готова ответить на все. Буду признательна за возможность исправить найденные ошибки с пересмотром оценки (если потребуется)\n
   В любом случае, спасибо за проверку и удачи в учебе))

Итак: 
в общем по выполению: писала с использованием SASS, normalize - разрешены по ТЗ;\n
для выстраивания блоков применялся Flex;\n
по PixelPerfect отклонение не больше 5px по всем блокам.\n

Вёрстка страницы Main соответствует макету при ширине экрана 1280px: +14 - соответствует по всем блокам

Вёрстка страницы Main соответствует макету при ширине экрана 768px: +14 - соответствует по всем блокам 

Вёрстка страницы Main соответствует макету при ширине экрана 320px: +14 - соответствует по всем блокам 

Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +6 - соответствует по всем блокам 

Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +6 - соответствует по всем блокам  

Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +6 - соответствует по всем блокам 

Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20 - выполнено на всех разрешениях от 1280ox до 320px включительно 

Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции (Примеры неправильной и правильной реализации): +8 - выполнено

При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4 - выполнено 

Открытие меню при клике на иконку бургер-меню на текущем этапе не проверяется - не реализовывалось на данном этапе

Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ : +8 - ошибок или предупреждений нет`

)

